#pragma once
#include <vector>
#include <string>

namespace rfxh::logo::builtin::cat_android {

inline std::vector<std::string> logo_an_android_15() {
    return {
        "   ▂▄▄▅▅▅▅▅▅▅▅▅▅▅▅▅▄▄▂   ",
        "  ▟███████████████████▙  ",
        " ▐██▎     ▖▕█▏      ▕██▌ ",
        "  ██▙  ▗ ▖  ▉   ▁ ▔ ▟██  ",
        "  ▝██▙▖▕▘  ▟█▙  ▘▝▗▟█▉▘  ",
        "    ▜██▖ ▜▆███▆▛ ▗██▛    ",
        "     ▜██▇███████▇██▛     ",
        "      ▜███████████▛      ",
        "       ▜█████████▛       ",
        "        ▀███████▀        ",
        "         ▝▀███▀▘         ",
    };
}

}
